input/pagecontent/care-services.md
```mermaid
sequenceDiagram
    actor Admin as Care provider<br/>administrator
    actor SPAdmin as Service Provider<br/>administrator
    participant SP as Service Provider<br/>(Data Source)
    participant DSAdmin as LRZa Portal<br/>(Data Source)
    participant LRZa as LRZa Directory

    activate Admin
    activate DSAdmin
    Admin->>DSAdmin: Register authorization for IT vendor
    activate LRZa
    DSAdmin->>LRZa: POST /OrganizationAffiliation<br/>(organization,<br/>participatingOrganization, code)
    LRZa-->>DSAdmin: 201 Created
    DSAdmin-->>Admin: Authorization active
    deactivate DSAdmin

    Note over Admin,LRZa: After affiliation is active

    activate SPAdmin
    activate SP
    SPAdmin->>SP: Register new endpoints for EHR system
    SP->>LRZa: POST /Endpoint
    Note right of SP: If the endpoints were already registered<br/>for other care providers, these Endpoint<br/>updates can be skipped.
    deactivate SPAdmin
    Admin->>SP: Link endpoints to organization
    SP->>LRZa: PUT /Organization/ura-123
    Admin->>SP: Register new location
    SP->>LRZa: POST /Location
    Admin->>SP: Register new healthcare service<br/>with links to location and endpoints
    SP->>LRZa: POST /HealthcareService
    Note over LRZa: Authorization checks are based on<br/>OrganizationAffiliation and requested scope.
    deactivate SP
    deactivate LRZa
    deactivate Admin
```
