input/pagecontent/care-services.md
```mermaid
sequenceDiagram
    actor Patient as Vera
    actor Doctor as Dr. West
    participant EHR as EHR (Query Client)
    participant CSD as Directory<br/>(local replica)

    activate Patient
    activate Doctor
    Patient->>Doctor: My knee hurts
    Doctor->>Doctor: diagnosis = torn ACL
    activate EHR
    Doctor->>EHR: use EHR's custom query tool,<br/>search for orthopedic services,<br/>within 30km of Vera's home
    activate CSD
    EHR->>CSD: Find Matching Care Services request<br/>GET [base]/HealthcareService?<br/>type=consultation&specialty=orthopedics
    CSD-->>EHR: response
    EHR->>CSD: Get (parent) Organizations and Locations<br/>for HealthcareServices<br/>GET /Organization/[id], GET /Location/[id], etc
    CSD-->>EHR: response
    EHR->>EHR: Filter results on distance to Vera's home
    deactivate CSD
    EHR-->>Doctor: Review results<br/>with office address, hours of operation
    Doctor-->>Patient: Review and discuss options
    deactivate Patient
    deactivate Doctor
    deactivate EHR
```
