input/pagecontent/care-services.md
```mermaid
sequenceDiagram
    actor Doctor as Dr. West
    participant EHR as EHR
    participant CSD as Directory<br/>(local replica)
    participant EHR2 as Endpoint supporting<br/>Transfer of care<br/>@Hospital East

    activate Doctor
    activate EHR
    rect rgb(238, 242, 245)
        Note over Doctor,EHR: create referral
        Doctor->>EHR: create referral for Dr. East<br/>for Orthopedic department at Hospital East
    end
    activate CSD
    EHR->>CSD: Find HealthcareService of Orthopedic<br/>department including Endpoints<br/>GET /HealthcareService/[id], GET /Endpoint/[id]
    EHR->>EHR: Check Endpoints for 'Transfer of care' support
    deactivate CSD
    EHR-->>Doctor: If no endpoint found: Use other means to send referral
    deactivate Doctor
    activate EHR2
    EHR->>EHR2: Post notification to Endpoint<br/>of Hospital East with referral ID
    deactivate EHR
    deactivate EHR2
```
